OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1566.h
extern __at(0x0216) __sfr SSPCON2;

typedef struct
  {
  unsigned SEN                  : 1;
  unsigned RSEN                 : 1;
  unsigned PEN                  : 1;
  unsigned RCEN                 : 1;
  unsigned ACKEN                : 1;
  unsigned ACKDT                : 1;
  unsigned ACKSTAT              : 1;
  unsigned GCEN                 : 1;
  } __SSPCON2bits_t;

extern __at(0x0216) volatile __SSPCON2bits_t SSPCON2bits;

#define _SSPCON2_SEN            0x01
#define _SSPCON2_RSEN           0x02
#define _SSPCON2_PEN            0x04
#define _SSPCON2_RCEN           0x08
#define _SSPCON2_ACKEN          0x10
#define _SSPCON2_ACKDT          0x20
#define _SSPCON2_ACKSTAT        0x40
#define _SSPCON2_GCEN           0x80

//==============================================================================


//==============================================================================
//        SSP1CON3 Bits

extern __at(0x0217) __sfr SSP1CON3;

typedef struct
  {
  unsigned DHEN                 : 1;
  unsigned AHEN                 : 1;
  unsigned SBCDE                : 1;
  unsigned SDAHT                : 1;
  unsigned BOEN                 : 1;
  unsigned SCIE                 : 1;
  unsigned PCIE                 : 1;
  unsigned ACKTIM               : 1;
  } __SSP1CON3bits_t;

extern __at(0x0217) volatile __SSP1CON3bits_t SSP1CON3bits;

#define _DHEN                   0x01
#define _AHEN                   0x02
#define _SBCDE                  0x04
#define _SDAHT                  0x08
#define _BOEN                   0x10
#define _SCIE                   0x20
#define _PCIE                   0x40
#define _ACKTIM                 0x80

//==============================================================================


//==============================================================================
//        SSPCON3 Bits

extern __at(0x0217) __sfr SSPCON3;

typedef struct
  {
  unsigned DHEN                 : 1;
  unsigned AHEN                 : 1;
  unsigned SBCDE                : 1;
  unsigned SDAHT                : 1;
  unsigned BOEN                 : 1;
  unsigned SCIE                 : 1;
  unsigned PCIE                 : 1;
  unsigned ACKTIM               : 1;
  } __SSPCON3bits_t;

extern __at(0x0217) volatile __SSPCON3bits_t SSPCON3bits;

#define _SSPCON3_DHEN           0x01
#define _SSPCON3_AHEN           0x02
#define _SSPCON3_SBCDE          0x04
#define _SSPCON3_SDAHT          0x08
#define _SSPCON3_BOEN           0x10
#define _SSPCON3_SCIE           0x20
#define _SSPCON3_PCIE           0x40
#define _SSPCON3_ACKTIM         0x80

//==============================================================================


//==============================================================================
//        SSPLVL Bits

extern __at(0x0218) __sfr SSPLVL;

typedef struct
  {
  unsigned S1ILS                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned S2ILS                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __SSPLVLbits_t;

extern __at(0x0218) volatile __SSPLVLbits_t SSPLVLbits;

#define _S1ILS                  0x01
#define _S2ILS                  0x10

//==============================================================================


//==============================================================================
//        SSP2BUF Bits

extern __at(0x0219) __sfr SSP2BUF;

typedef union
  {
  struct
    {
    unsigned SSP2BUF0           : 1;
    unsigned SSP2BUF1           : 1;
    unsigned SSP2BUF2           : 1;
    unsigned SSP2BUF3           : 1;
    unsigned SSP2BUF4           : 1;
    unsigned SSP2BUF5           : 1;
    unsigned SSP2BUF6           : 1;
    unsigned SSP2BUF7           : 1;
    };

  struct
    {
    unsigned BUF0               : 1;
    unsigned BUF1               : 1;
    unsigned BUF2               : 1;
    unsigned BUF3               : 1;
    unsigned BUF4               : 1;
    unsigned BUF5               : 1;
    unsigned BUF6               : 1;
    unsigned BUF7               : 1;
    };
  } __SSP2BUFbits_t;

extern __at(0x0219) volatile __SSP2BUFbits_t SSP2BUFbits;

#define _SSP2BUF_SSP2BUF0       0x01
#define _SSP2BUF_BUF0           0x01
#define _SSP2BUF_SSP2BUF1       0x02
#define _SSP2BUF_BUF1           0x02
#define _SSP2BUF_SSP2BUF2       0x04
#define _SSP2BUF_BUF2           0x04
#define _SSP2BUF_SSP2BUF3       0x08
#define _SSP2BUF_BUF3           0x08
#define _SSP2BUF_SSP2BUF4       0x10
#define _SSP2BUF_BUF4           0x10
#define _SSP2BUF_SSP2BUF5       0x20
#define _SSP2BUF_BUF5           0x20
#define _SSP2BUF_SSP2BUF6       0x40
#define _SSP2BUF_BUF6           0x40
#define _SSP2BUF_SSP2BUF7       0x80
#define _SSP2BUF_BUF7           0x80

//==============================================================================


//==============================================================================
//        SSP2ADD Bits

extern __at(0x021A) __sfr SSP2ADD;

typedef union
  {
  struct
    {
    unsigned SSP2ADD0           : 1;
    unsigned SSP2ADD1           : 1;
    unsigned SSP2ADD2           : 1;
    unsigned SSP2ADD3           : 1;
    unsigned SSP2ADD4           : 1;
    unsigned SSP2ADD5           : 1;
    unsigned SSP2ADD6           : 1;
    unsigned SSP2ADD7           : 1;
    };

  struct
    {
    unsigned ADD0               : 1;
    unsigned ADD1               : 1;
    unsigned ADD2               : 1;
    unsigned ADD3               : 1;
    unsigned ADD4               : 1;
    unsigned ADD5               : 1;
    unsigned ADD6               : 1;
    unsigned ADD7               : 1;
    };
  } __SSP2ADDbits_t;

extern __at(0x021A) volatile __SSP2ADDbits_t SSP2ADDbits;

#define _SSP2ADD_SSP2ADD0       0x01
#define _SSP2ADD_ADD0           0x01
#define _SSP2ADD_SSP2ADD1       0x02
#define _SSP2ADD_ADD1           0x02
#define _SSP2ADD_SSP2ADD2       0x04
#define _SSP2ADD_ADD2           0x04
#define _SSP2ADD_SSP2ADD3       0x08
#define _SSP2ADD_ADD3           0x08
#define _SSP2ADD_SSP2ADD4       0x10
#define _SSP2ADD_ADD4           0x10
#define _SSP2ADD_SSP2ADD5       0x20
#define _SSP2ADD_ADD5           0x20
#define _SSP2ADD_SSP2ADD6       0x40
#define _SSP2ADD_ADD6           0x40
#define _SSP2ADD_SSP2ADD7       0x80
#define _SSP2ADD_ADD7           0x80

//==============================================================================


//==============================================================================
//        SSP2MSK Bits

