OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1566.h
#define _PWM1CON0_PWM1POL       0x10
#define _PWM1CON0_PWM1OUT       0x20
#define _PWM1CON0_PWM1OE        0x40
#define _PWM1CON0_PWM1EN        0x80

//==============================================================================


//==============================================================================
//        PWM2DCL Bits

extern __at(0x0614) __sfr PWM2DCL;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM2DCL0           : 1;
    unsigned PWM2DCL1           : 1;
    };

  struct
    {
    unsigned                    : 6;
    unsigned PWM2DCL            : 2;
    };
  } __PWM2DCLbits_t;

extern __at(0x0614) volatile __PWM2DCLbits_t PWM2DCLbits;

#define _PWM2DCL0               0x40
#define _PWM2DCL1               0x80

//==============================================================================


//==============================================================================
//        PWM2DCH Bits

extern __at(0x0615) __sfr PWM2DCH;

typedef struct
  {
  unsigned PWM2DCH0             : 1;
  unsigned PWM2DCH1             : 1;
  unsigned PWM2DCH2             : 1;
  unsigned PWM2DCH3             : 1;
  unsigned PWM2DCH4             : 1;
  unsigned PWM2DCH5             : 1;
  unsigned PWM2DCH6             : 1;
  unsigned PWM2DCH7             : 1;
  } __PWM2DCHbits_t;

extern __at(0x0615) volatile __PWM2DCHbits_t PWM2DCHbits;

#define _PWM2DCH0               0x01
#define _PWM2DCH1               0x02
#define _PWM2DCH2               0x04
#define _PWM2DCH3               0x08
#define _PWM2DCH4               0x10
#define _PWM2DCH5               0x20
#define _PWM2DCH6               0x40
#define _PWM2DCH7               0x80

//==============================================================================


//==============================================================================
//        PWM2CON Bits

extern __at(0x0616) __sfr PWM2CON;

typedef struct
  {
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned PWM2POL              : 1;
  unsigned PWM2OUT              : 1;
  unsigned PWM2OE               : 1;
  unsigned PWM2EN               : 1;
  } __PWM2CONbits_t;

extern __at(0x0616) volatile __PWM2CONbits_t PWM2CONbits;

#define _PWM2POL                0x10
#define _PWM2OUT                0x20
#define _PWM2OE                 0x40
#define _PWM2EN                 0x80

//==============================================================================


//==============================================================================
//        PWM2CON0 Bits

extern __at(0x0616) __sfr PWM2CON0;

typedef struct
  {
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned PWM2POL              : 1;
  unsigned PWM2OUT              : 1;
  unsigned PWM2OE               : 1;
  unsigned PWM2EN               : 1;
  } __PWM2CON0bits_t;

extern __at(0x0616) volatile __PWM2CON0bits_t PWM2CON0bits;

#define _PWM2CON0_PWM2POL       0x10
#define _PWM2CON0_PWM2OUT       0x20
#define _PWM2CON0_PWM2OE        0x40
#define _PWM2CON0_PWM2EN        0x80

//==============================================================================


//==============================================================================
//        PWMTMRS Bits

extern __at(0x061D) __sfr PWMTMRS;

typedef struct
  {
  unsigned P1TSEL               : 1;
  unsigned                      : 1;
  unsigned P2TSEL               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PWMTMRSbits_t;

extern __at(0x061D) volatile __PWMTMRSbits_t PWMTMRSbits;

#define _P1TSEL                 0x01
#define _P2TSEL                 0x04

//==============================================================================


//==============================================================================
//        PWM1AOE Bits

extern __at(0x061E) __sfr PWM1AOE;

typedef union
  {
  struct
    {
    unsigned PWM1OE0            : 1;
    unsigned PWM1OE1            : 1;
    unsigned PWM1OE2            : 1;
    unsigned PWM1OE3            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM1OE             : 4;
    unsigned                    : 4;
    };
  } __PWM1AOEbits_t;

extern __at(0x061E) volatile __PWM1AOEbits_t PWM1AOEbits;

#define _PWM1OE0                0x01
#define _PWM1OE1                0x02
#define _PWM1OE2                0x04
#define _PWM1OE3                0x08

//==============================================================================


//==============================================================================
//        PWM2AOE Bits

extern __at(0x061F) __sfr PWM2AOE;

typedef union
  {
  struct
    {
    unsigned PWM2OE0            : 1;
    unsigned PWM2OE1            : 1;
    unsigned PWM2OE2            : 1;
    unsigned PWM2OE3            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM2OE             : 4;
    unsigned                    : 4;
    };
  } __PWM2AOEbits_t;

extern __at(0x061F) volatile __PWM2AOEbits_t PWM2AOEbits;

#define _PWM2OE0                0x01
#define _PWM2OE1                0x02
#define _PWM2OE2                0x04
#define _PWM2OE3                0x08

//==============================================================================


//==============================================================================
//        ADCTX Bits

extern __at(0x0691) __sfr ADCTX;

typedef union
  {
  struct
    {
    unsigned A1TX0              : 1;
    unsigned A1TX1              : 1;
    unsigned A1TX2              : 1;
    unsigned                    : 1;
    unsigned A2TX0              : 1;
    unsigned A2TX1              : 1;
    unsigned A2TX2              : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned A1TX               : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned                    : 4;
    unsigned A2TX               : 3;
    unsigned                    : 1;
    };
  } __ADCTXbits_t;

extern __at(0x0691) volatile __ADCTXbits_t ADCTXbits;

#define _A1TX0                  0x01
#define _A1TX1                  0x02
#define _A1TX2                  0x04
#define _A2TX0                  0x10
#define _A2TX1                  0x20
#define _A2TX2                  0x40

//==============================================================================

extern __at(0x0692) __sfr AAD1TX;

//==============================================================================
//        AAD1TX0 Bits

