OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1566.h
extern __at(0x0692) __sfr AAD1TX0;

typedef struct
  {
  unsigned TX10                 : 1;
  unsigned TX11                 : 1;
  unsigned TX12                 : 1;
  unsigned TX13                 : 1;
  unsigned TX14                 : 1;
  unsigned TX15                 : 1;
  unsigned TX16                 : 1;
  unsigned TX17                 : 1;
  } __AAD1TX0bits_t;

extern __at(0x0692) volatile __AAD1TX0bits_t AAD1TX0bits;

#define _TX10                   0x01
#define _TX11                   0x02
#define _TX12                   0x04
#define _TX13                   0x08
#define _TX14                   0x10
#define _TX15                   0x20
#define _TX16                   0x40
#define _TX17                   0x80

//==============================================================================

extern __at(0x0692) __sfr AD1TX;

//==============================================================================
//        AD1TX0 Bits

extern __at(0x0692) __sfr AD1TX0;

typedef struct
  {
  unsigned TX10                 : 1;
  unsigned TX11                 : 1;
  unsigned TX12                 : 1;
  unsigned TX13                 : 1;
  unsigned TX14                 : 1;
  unsigned TX15                 : 1;
  unsigned TX16                 : 1;
  unsigned TX17                 : 1;
  } __AD1TX0bits_t;

extern __at(0x0692) volatile __AD1TX0bits_t AD1TX0bits;

#define _AD1TX0_TX10            0x01
#define _AD1TX0_TX11            0x02
#define _AD1TX0_TX12            0x04
#define _AD1TX0_TX13            0x08
#define _AD1TX0_TX14            0x10
#define _AD1TX0_TX15            0x20
#define _AD1TX0_TX16            0x40
#define _AD1TX0_TX17            0x80

//==============================================================================


//==============================================================================
//        AAD1TX1 Bits

extern __at(0x0693) __sfr AAD1TX1;

typedef struct
  {
  unsigned TX18                 : 1;
  unsigned TX19                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __AAD1TX1bits_t;

extern __at(0x0693) volatile __AAD1TX1bits_t AAD1TX1bits;

#define _TX18                   0x01
#define _TX19                   0x02

//==============================================================================


//==============================================================================
//        AD1TX1 Bits

extern __at(0x0693) __sfr AD1TX1;

typedef struct
  {
  unsigned TX18                 : 1;
  unsigned TX19                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __AD1TX1bits_t;

extern __at(0x0693) volatile __AD1TX1bits_t AD1TX1bits;

#define _AD1TX1_TX18            0x01
#define _AD1TX1_TX19            0x02

//==============================================================================

extern __at(0x0694) __sfr AAD2TX;

//==============================================================================
//        AAD2TX0 Bits

extern __at(0x0694) __sfr AAD2TX0;

typedef struct
  {
  unsigned TX20                 : 1;
  unsigned TX21                 : 1;
  unsigned TX22                 : 1;
  unsigned TX23                 : 1;
  unsigned TX24                 : 1;
  unsigned TX25                 : 1;
  unsigned TX26                 : 1;
  unsigned TX27                 : 1;
  } __AAD2TX0bits_t;

extern __at(0x0694) volatile __AAD2TX0bits_t AAD2TX0bits;

#define _TX20                   0x01
#define _TX21                   0x02
#define _TX22                   0x04
#define _TX23                   0x08
#define _TX24                   0x10
#define _TX25                   0x20
#define _TX26                   0x40
#define _TX27                   0x80

//==============================================================================

extern __at(0x0694) __sfr AD2TX;

//==============================================================================
//        AD2TX0 Bits

extern __at(0x0694) __sfr AD2TX0;

typedef struct
  {
  unsigned TX20                 : 1;
  unsigned TX21                 : 1;
  unsigned TX22                 : 1;
  unsigned TX23                 : 1;
  unsigned TX24                 : 1;
  unsigned TX25                 : 1;
  unsigned TX26                 : 1;
  unsigned TX27                 : 1;
  } __AD2TX0bits_t;

extern __at(0x0694) volatile __AD2TX0bits_t AD2TX0bits;

#define _AD2TX0_TX20            0x01
#define _AD2TX0_TX21            0x02
#define _AD2TX0_TX22            0x04
#define _AD2TX0_TX23            0x08
#define _AD2TX0_TX24            0x10
#define _AD2TX0_TX25            0x20
#define _AD2TX0_TX26            0x40
#define _AD2TX0_TX27            0x80

//==============================================================================


//==============================================================================
//        AAD2TX1 Bits

extern __at(0x0695) __sfr AAD2TX1;

typedef struct
  {
  unsigned TX28                 : 1;
  unsigned TX29                 : 1;
  unsigned TX40                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __AAD2TX1bits_t;

extern __at(0x0695) volatile __AAD2TX1bits_t AAD2TX1bits;

#define _TX28                   0x01
#define _TX29                   0x02
#define _TX40                   0x04

//==============================================================================


//==============================================================================
//        AD2TX1 Bits

extern __at(0x0695) __sfr AD2TX1;

typedef struct
  {
  unsigned TX28                 : 1;
  unsigned TX29                 : 1;
  unsigned TX40                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __AD2TX1bits_t;

extern __at(0x0695) volatile __AD2TX1bits_t AD2TX1bits;

#define _AD2TX1_TX28            0x01
#define _AD2TX1_TX29            0x02
#define _AD2TX1_TX40            0x04

//==============================================================================


//==============================================================================
//        AAD1CON0 Bits

extern __at(0x0711) __sfr AAD1CON0;

typedef union
  {
  struct
    {
    unsigned ADON               : 1;
    unsigned GO                 : 1;
    unsigned CHS0               : 1;
    unsigned CHS1               : 1;
    unsigned CHS2               : 1;
    unsigned CHS3               : 1;
    unsigned CHS4               : 1;
    unsigned CHS5               : 1;
    };

  struct
    {
    unsigned AD1ON              : 1;
    unsigned GO_NOT_DONE        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned GO_NOT_DONE1       : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned CHS                : 6;
    };
  } __AAD1CON0bits_t;

extern __at(0x0711) volatile __AAD1CON0bits_t AAD1CON0bits;

#define _ADON                   0x01
#define _AD1ON                  0x01
#define _GO                     0x02
#define _GO_NOT_DONE            0x02
#define _GO_NOT_DONE1           0x02
#define _CHS0                   0x04
#define _CHS1                   0x08
#define _CHS2                   0x10
#define _CHS3                   0x20
#define _CHS4                   0x40
#define _CHS5                   0x80

//==============================================================================


//==============================================================================
//        AADCON0 Bits

extern __at(0x0711) __sfr AADCON0;

typedef union
  {
  struct
    {
    unsigned ADON               : 1;
    unsigned GO                 : 1;
    unsigned CHS0               : 1;
    unsigned CHS1               : 1;
    unsigned CHS2               : 1;
    unsigned CHS3               : 1;
    unsigned CHS4               : 1;
    unsigned CHS5               : 1;
    };

  struct
    {
    unsigned AD1ON              : 1;
    unsigned GO_NOT_DONE        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned GO_NOT_DONE1       : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned CHS                : 6;
    };
  } __AADCON0bits_t;

extern __at(0x0711) volatile __AADCON0bits_t AADCON0bits;

#define _AADCON0_ADON           0x01
#define _AADCON0_AD1ON          0x01
#define _AADCON0_GO             0x02
#define _AADCON0_GO_NOT_DONE    0x02
#define _AADCON0_GO_NOT_DONE1   0x02
#define _AADCON0_CHS0           0x04
#define _AADCON0_CHS1           0x08
#define _AADCON0_CHS2           0x10
#define _AADCON0_CHS3           0x20
#define _AADCON0_CHS4           0x40
#define _AADCON0_CHS5           0x80

//==============================================================================


//==============================================================================
//        AD1CON0 Bits

extern __at(0x0711) __sfr AD1CON0;

typedef union
  {
  struct
    {
    unsigned ADON               : 1;
    unsigned GO                 : 1;
    unsigned CHS0               : 1;
    unsigned CHS1               : 1;
    unsigned CHS2               : 1;
    unsigned CHS3               : 1;
    unsigned CHS4               : 1;
    unsigned CHS5               : 1;
    };

  struct
    {
    unsigned AD1ON              : 1;
    unsigned GO_NOT_DONE        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned GO_NOT_DONE1       : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned CHS                : 6;
    };
  } __AD1CON0bits_t;

