OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1566.h
extern __at(0x0711) volatile __AD1CON0bits_t AD1CON0bits;

#define _AD1CON0_ADON           0x01
#define _AD1CON0_AD1ON          0x01
#define _AD1CON0_GO             0x02
#define _AD1CON0_GO_NOT_DONE    0x02
#define _AD1CON0_GO_NOT_DONE1   0x02
#define _AD1CON0_CHS0           0x04
#define _AD1CON0_CHS1           0x08
#define _AD1CON0_CHS2           0x10
#define _AD1CON0_CHS3           0x20
#define _AD1CON0_CHS4           0x40
#define _AD1CON0_CHS5           0x80

//==============================================================================


//==============================================================================
//        AADCON1 Bits

extern __at(0x0712) __sfr AADCON1;

typedef union
  {
  struct
    {
    unsigned ADPREF0            : 1;
    unsigned ADPREF1            : 1;
    unsigned GO_NOT_DONE_ALL    : 1;
    unsigned ADNREF             : 1;
    unsigned ADCS0              : 1;
    unsigned ADCS1              : 1;
    unsigned ADCS2              : 1;
    unsigned ADFM               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned GO_ALL             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADPREF             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned ADCS               : 3;
    unsigned                    : 1;
    };
  } __AADCON1bits_t;

extern __at(0x0712) volatile __AADCON1bits_t AADCON1bits;

#define _ADPREF0                0x01
#define _ADPREF1                0x02
#define _GO_NOT_DONE_ALL        0x04
#define _GO_ALL                 0x04
#define _ADNREF                 0x08
#define _ADCS0                  0x10
#define _ADCS1                  0x20
#define _ADCS2                  0x40
#define _ADFM                   0x80

//==============================================================================


//==============================================================================
//        ADCOMCON Bits

extern __at(0x0712) __sfr ADCOMCON;

typedef union
  {
  struct
    {
    unsigned ADPREF0            : 1;
    unsigned ADPREF1            : 1;
    unsigned GO_NOT_DONE_ALL    : 1;
    unsigned ADNREF             : 1;
    unsigned ADCS0              : 1;
    unsigned ADCS1              : 1;
    unsigned ADCS2              : 1;
    unsigned ADFM               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned GO_ALL             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADPREF             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned ADCS               : 3;
    unsigned                    : 1;
    };
  } __ADCOMCONbits_t;

extern __at(0x0712) volatile __ADCOMCONbits_t ADCOMCONbits;

#define _ADCOMCON_ADPREF0       0x01
#define _ADCOMCON_ADPREF1       0x02
#define _ADCOMCON_GO_NOT_DONE_ALL 0x04
#define _ADCOMCON_GO_ALL        0x04
#define _ADCOMCON_ADNREF        0x08
#define _ADCOMCON_ADCS0         0x10
#define _ADCOMCON_ADCS1         0x20
#define _ADCOMCON_ADCS2         0x40
#define _ADCOMCON_ADFM          0x80

//==============================================================================


//==============================================================================
//        AAD1CON2 Bits

extern __at(0x0713) __sfr AAD1CON2;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned TRIGSEL0           : 1;
    unsigned TRIGSEL1           : 1;
    unsigned TRIGSEL2           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned TRIGSEL            : 3;
    unsigned                    : 1;
    };
  } __AAD1CON2bits_t;

extern __at(0x0713) volatile __AAD1CON2bits_t AAD1CON2bits;

#define _TRIGSEL0               0x10
#define _TRIGSEL1               0x20
#define _TRIGSEL2               0x40

//==============================================================================


//==============================================================================
//        AADCON2 Bits

extern __at(0x0713) __sfr AADCON2;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned TRIGSEL0           : 1;
    unsigned TRIGSEL1           : 1;
    unsigned TRIGSEL2           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned TRIGSEL            : 3;
    unsigned                    : 1;
    };
  } __AADCON2bits_t;

extern __at(0x0713) volatile __AADCON2bits_t AADCON2bits;

#define _AADCON2_TRIGSEL0       0x10
#define _AADCON2_TRIGSEL1       0x20
#define _AADCON2_TRIGSEL2       0x40

//==============================================================================


//==============================================================================
//        AD1CON2 Bits

extern __at(0x0713) __sfr AD1CON2;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned TRIGSEL0           : 1;
    unsigned TRIGSEL1           : 1;
    unsigned TRIGSEL2           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned TRIGSEL            : 3;
    unsigned                    : 1;
    };
  } __AD1CON2bits_t;

