OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1566.h
extern __at(0x0713) volatile __AD1CON2bits_t AD1CON2bits;

#define _AD1CON2_TRIGSEL0       0x10
#define _AD1CON2_TRIGSEL1       0x20
#define _AD1CON2_TRIGSEL2       0x40

//==============================================================================


//==============================================================================
//        AAD1CON3 Bits

extern __at(0x0714) __sfr AAD1CON3;

typedef union
  {
  struct
    {
    unsigned AD1DSEN            : 1;
    unsigned AD1IPEN            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned AD1IPPOL           : 1;
    unsigned AD1EPPOL           : 1;
    };

  struct
    {
    unsigned ADDSEN             : 1;
    unsigned ADIPEN             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned ADIPPOL            : 1;
    unsigned ADEPPOL            : 1;
    };
  } __AAD1CON3bits_t;

extern __at(0x0714) volatile __AAD1CON3bits_t AAD1CON3bits;

#define _AD1DSEN                0x01
#define _ADDSEN                 0x01
#define _AD1IPEN                0x02
#define _ADIPEN                 0x02
#define _AD1IPPOL               0x40
#define _ADIPPOL                0x40
#define _AD1EPPOL               0x80
#define _ADEPPOL                0x80

//==============================================================================


//==============================================================================
//        AADCON3 Bits

extern __at(0x0714) __sfr AADCON3;

typedef union
  {
  struct
    {
    unsigned AD1DSEN            : 1;
    unsigned AD1IPEN            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned AD1IPPOL           : 1;
    unsigned AD1EPPOL           : 1;
    };

  struct
    {
    unsigned ADDSEN             : 1;
    unsigned ADIPEN             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned ADIPPOL            : 1;
    unsigned ADEPPOL            : 1;
    };
  } __AADCON3bits_t;

extern __at(0x0714) volatile __AADCON3bits_t AADCON3bits;

#define _AADCON3_AD1DSEN        0x01
#define _AADCON3_ADDSEN         0x01
#define _AADCON3_AD1IPEN        0x02
#define _AADCON3_ADIPEN         0x02
#define _AADCON3_AD1IPPOL       0x40
#define _AADCON3_ADIPPOL        0x40
#define _AADCON3_AD1EPPOL       0x80
#define _AADCON3_ADEPPOL        0x80

//==============================================================================


//==============================================================================
//        AD1CON3 Bits

extern __at(0x0714) __sfr AD1CON3;

typedef union
  {
  struct
    {
    unsigned AD1DSEN            : 1;
    unsigned AD1IPEN            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned AD1IPPOL           : 1;
    unsigned AD1EPPOL           : 1;
    };

  struct
    {
    unsigned ADDSEN             : 1;
    unsigned ADIPEN             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned ADIPPOL            : 1;
    unsigned ADEPPOL            : 1;
    };
  } __AD1CON3bits_t;

extern __at(0x0714) volatile __AD1CON3bits_t AD1CON3bits;

#define _AD1CON3_AD1DSEN        0x01
#define _AD1CON3_ADDSEN         0x01
#define _AD1CON3_AD1IPEN        0x02
#define _AD1CON3_ADIPEN         0x02
#define _AD1CON3_AD1IPPOL       0x40
#define _AD1CON3_ADIPPOL        0x40
#define _AD1CON3_AD1EPPOL       0x80
#define _AD1CON3_ADEPPOL        0x80

//==============================================================================


//==============================================================================
//        AADSTAT Bits

extern __at(0x0715) __sfr AADSTAT;

typedef union
  {
  struct
    {
    unsigned AD1STG0            : 1;
    unsigned AD1STG1            : 1;
    unsigned AD1CONV            : 1;
    unsigned                    : 1;
    unsigned AD2STG0            : 1;
    unsigned AD2STG1            : 1;
    unsigned AD2CONV            : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned ADCONV             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned AD1STG             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned AD2STG             : 2;
    unsigned                    : 2;
    };
  } __AADSTATbits_t;

extern __at(0x0715) volatile __AADSTATbits_t AADSTATbits;

#define _AD1STG0                0x01
#define _AD1STG1                0x02
#define _AD1CONV                0x04
#define _ADCONV                 0x04
#define _AD2STG0                0x10
#define _AD2STG1                0x20
#define _AD2CONV                0x40

//==============================================================================


//==============================================================================
//        ADSTAT Bits

extern __at(0x0715) __sfr ADSTAT;

typedef union
  {
  struct
    {
    unsigned AD1STG0            : 1;
    unsigned AD1STG1            : 1;
    unsigned AD1CONV            : 1;
    unsigned                    : 1;
    unsigned AD2STG0            : 1;
    unsigned AD2STG1            : 1;
    unsigned AD2CONV            : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned ADCONV             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned AD1STG             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned AD2STG             : 2;
    unsigned                    : 2;
    };
  } __ADSTATbits_t;

extern __at(0x0715) volatile __ADSTATbits_t ADSTATbits;

#define _ADSTAT_AD1STG0         0x01
#define _ADSTAT_AD1STG1         0x02
#define _ADSTAT_AD1CONV         0x04
#define _ADSTAT_ADCONV          0x04
#define _ADSTAT_AD2STG0         0x10
#define _ADSTAT_AD2STG1         0x20
#define _ADSTAT_AD2CONV         0x40

//==============================================================================


//==============================================================================
//        AAD1PRE Bits

extern __at(0x0716) __sfr AAD1PRE;

typedef union
  {
  struct
    {
    unsigned ADPRE0             : 1;
    unsigned ADPRE1             : 1;
    unsigned ADPRE2             : 1;
    unsigned ADPRE3             : 1;
    unsigned ADPRE4             : 1;
    unsigned ADPRE5             : 1;
    unsigned ADPRE6             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADPRE              : 7;
    unsigned                    : 1;
    };
  } __AAD1PREbits_t;

