OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1566.h
extern __at(0x0716) volatile __AAD1PREbits_t AAD1PREbits;

#define _ADPRE0                 0x01
#define _ADPRE1                 0x02
#define _ADPRE2                 0x04
#define _ADPRE3                 0x08
#define _ADPRE4                 0x10
#define _ADPRE5                 0x20
#define _ADPRE6                 0x40

//==============================================================================


//==============================================================================
//        AADPRE Bits

extern __at(0x0716) __sfr AADPRE;

typedef union
  {
  struct
    {
    unsigned ADPRE0             : 1;
    unsigned ADPRE1             : 1;
    unsigned ADPRE2             : 1;
    unsigned ADPRE3             : 1;
    unsigned ADPRE4             : 1;
    unsigned ADPRE5             : 1;
    unsigned ADPRE6             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADPRE              : 7;
    unsigned                    : 1;
    };
  } __AADPREbits_t;

extern __at(0x0716) volatile __AADPREbits_t AADPREbits;

#define _AADPRE_ADPRE0          0x01
#define _AADPRE_ADPRE1          0x02
#define _AADPRE_ADPRE2          0x04
#define _AADPRE_ADPRE3          0x08
#define _AADPRE_ADPRE4          0x10
#define _AADPRE_ADPRE5          0x20
#define _AADPRE_ADPRE6          0x40

//==============================================================================


//==============================================================================
//        AD1PRE Bits

extern __at(0x0716) __sfr AD1PRE;

typedef union
  {
  struct
    {
    unsigned ADPRE0             : 1;
    unsigned ADPRE1             : 1;
    unsigned ADPRE2             : 1;
    unsigned ADPRE3             : 1;
    unsigned ADPRE4             : 1;
    unsigned ADPRE5             : 1;
    unsigned ADPRE6             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADPRE              : 7;
    unsigned                    : 1;
    };
  } __AD1PREbits_t;

extern __at(0x0716) volatile __AD1PREbits_t AD1PREbits;

#define _AD1PRE_ADPRE0          0x01
#define _AD1PRE_ADPRE1          0x02
#define _AD1PRE_ADPRE2          0x04
#define _AD1PRE_ADPRE3          0x08
#define _AD1PRE_ADPRE4          0x10
#define _AD1PRE_ADPRE5          0x20
#define _AD1PRE_ADPRE6          0x40

//==============================================================================


//==============================================================================
//        AD1PRECON Bits

extern __at(0x0716) __sfr AD1PRECON;

typedef union
  {
  struct
    {
    unsigned ADPRE0             : 1;
    unsigned ADPRE1             : 1;
    unsigned ADPRE2             : 1;
    unsigned ADPRE3             : 1;
    unsigned ADPRE4             : 1;
    unsigned ADPRE5             : 1;
    unsigned ADPRE6             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADPRE              : 7;
    unsigned                    : 1;
    };
  } __AD1PRECONbits_t;

extern __at(0x0716) volatile __AD1PRECONbits_t AD1PRECONbits;

#define _AD1PRECON_ADPRE0       0x01
#define _AD1PRECON_ADPRE1       0x02
#define _AD1PRECON_ADPRE2       0x04
#define _AD1PRECON_ADPRE3       0x08
#define _AD1PRECON_ADPRE4       0x10
#define _AD1PRECON_ADPRE5       0x20
#define _AD1PRECON_ADPRE6       0x40

//==============================================================================


//==============================================================================
//        AAD1ACQ Bits

extern __at(0x0717) __sfr AAD1ACQ;

typedef union
  {
  struct
    {
    unsigned ADACQ0             : 1;
    unsigned ADACQ1             : 1;
    unsigned ADACQ2             : 1;
    unsigned ADACQ3             : 1;
    unsigned ADACQ4             : 1;
    unsigned ADACQ5             : 1;
    unsigned ADACQ6             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADACQ              : 7;
    unsigned                    : 1;
    };
  } __AAD1ACQbits_t;

extern __at(0x0717) volatile __AAD1ACQbits_t AAD1ACQbits;

#define _ADACQ0                 0x01
#define _ADACQ1                 0x02
#define _ADACQ2                 0x04
#define _ADACQ3                 0x08
#define _ADACQ4                 0x10
#define _ADACQ5                 0x20
#define _ADACQ6                 0x40

//==============================================================================


//==============================================================================
//        AADACQ Bits

extern __at(0x0717) __sfr AADACQ;

typedef union
  {
  struct
    {
    unsigned ADACQ0             : 1;
    unsigned ADACQ1             : 1;
    unsigned ADACQ2             : 1;
    unsigned ADACQ3             : 1;
    unsigned ADACQ4             : 1;
    unsigned ADACQ5             : 1;
    unsigned ADACQ6             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADACQ              : 7;
    unsigned                    : 1;
    };
  } __AADACQbits_t;

extern __at(0x0717) volatile __AADACQbits_t AADACQbits;

#define _AADACQ_ADACQ0          0x01
#define _AADACQ_ADACQ1          0x02
#define _AADACQ_ADACQ2          0x04
#define _AADACQ_ADACQ3          0x08
#define _AADACQ_ADACQ4          0x10
#define _AADACQ_ADACQ5          0x20
#define _AADACQ_ADACQ6          0x40

//==============================================================================


//==============================================================================
//        AD1ACQ Bits

extern __at(0x0717) __sfr AD1ACQ;

typedef union
  {
  struct
    {
    unsigned ADACQ0             : 1;
    unsigned ADACQ1             : 1;
    unsigned ADACQ2             : 1;
    unsigned ADACQ3             : 1;
    unsigned ADACQ4             : 1;
    unsigned ADACQ5             : 1;
    unsigned ADACQ6             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADACQ              : 7;
    unsigned                    : 1;
    };
  } __AD1ACQbits_t;

extern __at(0x0717) volatile __AD1ACQbits_t AD1ACQbits;

#define _AD1ACQ_ADACQ0          0x01
#define _AD1ACQ_ADACQ1          0x02
#define _AD1ACQ_ADACQ2          0x04
#define _AD1ACQ_ADACQ3          0x08
#define _AD1ACQ_ADACQ4          0x10
#define _AD1ACQ_ADACQ5          0x20
#define _AD1ACQ_ADACQ6          0x40

//==============================================================================


//==============================================================================
//        AD1ACQCON Bits

extern __at(0x0717) __sfr AD1ACQCON;

typedef union
  {
  struct
    {
    unsigned ADACQ0             : 1;
    unsigned ADACQ1             : 1;
    unsigned ADACQ2             : 1;
    unsigned ADACQ3             : 1;
    unsigned ADACQ4             : 1;
    unsigned ADACQ5             : 1;
    unsigned ADACQ6             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADACQ              : 7;
    unsigned                    : 1;
    };
  } __AD1ACQCONbits_t;

extern __at(0x0717) volatile __AD1ACQCONbits_t AD1ACQCONbits;

