OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1566.h
#define _AD1ACQCON_ADACQ0       0x01
#define _AD1ACQCON_ADACQ1       0x02
#define _AD1ACQCON_ADACQ2       0x04
#define _AD1ACQCON_ADACQ3       0x08
#define _AD1ACQCON_ADACQ4       0x10
#define _AD1ACQCON_ADACQ5       0x20
#define _AD1ACQCON_ADACQ6       0x40

//==============================================================================


//==============================================================================
//        AAD1GRD Bits

extern __at(0x0718) __sfr AAD1GRD;

typedef union
  {
  struct
    {
    unsigned TX1POL             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned GRD1POL            : 1;
    unsigned GRD1AOE            : 1;
    unsigned GRD1BOE            : 1;
    };

  struct
    {
    unsigned TXPOL              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned GRDPOL             : 1;
    unsigned GRDAOE             : 1;
    unsigned GRDBOE             : 1;
    };
  } __AAD1GRDbits_t;

extern __at(0x0718) volatile __AAD1GRDbits_t AAD1GRDbits;

#define _TX1POL                 0x01
#define _TXPOL                  0x01
#define _GRD1POL                0x20
#define _GRDPOL                 0x20
#define _GRD1AOE                0x40
#define _GRDAOE                 0x40
#define _GRD1BOE                0x80
#define _GRDBOE                 0x80

//==============================================================================


//==============================================================================
//        AADGRD Bits

extern __at(0x0718) __sfr AADGRD;

typedef union
  {
  struct
    {
    unsigned TX1POL             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned GRD1POL            : 1;
    unsigned GRD1AOE            : 1;
    unsigned GRD1BOE            : 1;
    };

  struct
    {
    unsigned TXPOL              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned GRDPOL             : 1;
    unsigned GRDAOE             : 1;
    unsigned GRDBOE             : 1;
    };
  } __AADGRDbits_t;

extern __at(0x0718) volatile __AADGRDbits_t AADGRDbits;

#define _AADGRD_TX1POL          0x01
#define _AADGRD_TXPOL           0x01
#define _AADGRD_GRD1POL         0x20
#define _AADGRD_GRDPOL          0x20
#define _AADGRD_GRD1AOE         0x40
#define _AADGRD_GRDAOE          0x40
#define _AADGRD_GRD1BOE         0x80
#define _AADGRD_GRDBOE          0x80

//==============================================================================


//==============================================================================
//        AD1GRD Bits

extern __at(0x0718) __sfr AD1GRD;

typedef union
  {
  struct
    {
    unsigned TX1POL             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned GRD1POL            : 1;
    unsigned GRD1AOE            : 1;
    unsigned GRD1BOE            : 1;
    };

  struct
    {
    unsigned TXPOL              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned GRDPOL             : 1;
    unsigned GRDAOE             : 1;
    unsigned GRDBOE             : 1;
    };
  } __AD1GRDbits_t;

extern __at(0x0718) volatile __AD1GRDbits_t AD1GRDbits;

#define _AD1GRD_TX1POL          0x01
#define _AD1GRD_TXPOL           0x01
#define _AD1GRD_GRD1POL         0x20
#define _AD1GRD_GRDPOL          0x20
#define _AD1GRD_GRD1AOE         0x40
#define _AD1GRD_GRDAOE          0x40
#define _AD1GRD_GRD1BOE         0x80
#define _AD1GRD_GRDBOE          0x80

//==============================================================================


//==============================================================================
//        AAD1CAP Bits

extern __at(0x0719) __sfr AAD1CAP;

typedef union
  {
  struct
    {
    unsigned ADDCAP0            : 1;
    unsigned ADDCAP1            : 1;
    unsigned ADDCAP2            : 1;
    unsigned ADDCAP3            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADDCAP             : 4;
    unsigned                    : 4;
    };
  } __AAD1CAPbits_t;

extern __at(0x0719) volatile __AAD1CAPbits_t AAD1CAPbits;

#define _ADDCAP0                0x01
#define _ADDCAP1                0x02
#define _ADDCAP2                0x04
#define _ADDCAP3                0x08

//==============================================================================


//==============================================================================
//        AAD1CAPCON Bits

extern __at(0x0719) __sfr AAD1CAPCON;

typedef union
  {
  struct
    {
    unsigned ADDCAP0            : 1;
    unsigned ADDCAP1            : 1;
    unsigned ADDCAP2            : 1;
    unsigned ADDCAP3            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADDCAP             : 4;
    unsigned                    : 4;
    };
  } __AAD1CAPCONbits_t;

extern __at(0x0719) volatile __AAD1CAPCONbits_t AAD1CAPCONbits;

#define _AAD1CAPCON_ADDCAP0     0x01
#define _AAD1CAPCON_ADDCAP1     0x02
#define _AAD1CAPCON_ADDCAP2     0x04
#define _AAD1CAPCON_ADDCAP3     0x08

//==============================================================================


//==============================================================================
//        AADCAP Bits

extern __at(0x0719) __sfr AADCAP;

typedef union
  {
  struct
    {
    unsigned ADDCAP0            : 1;
    unsigned ADDCAP1            : 1;
    unsigned ADDCAP2            : 1;
    unsigned ADDCAP3            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADDCAP             : 4;
    unsigned                    : 4;
    };
  } __AADCAPbits_t;

