OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1566.h
extern __at(0x0798) __sfr AAD2GRD;

typedef union
  {
  struct
    {
    unsigned TX2POL             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned GRD2POL            : 1;
    unsigned GRD2AOE            : 1;
    unsigned GRD2BOE            : 1;
    };

  struct
    {
    unsigned TXPOL              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned GRDPOL             : 1;
    unsigned GRDAOE             : 1;
    unsigned GRDBOE             : 1;
    };
  } __AAD2GRDbits_t;

extern __at(0x0798) volatile __AAD2GRDbits_t AAD2GRDbits;

#define _AAD2GRD_TX2POL         0x01
#define _AAD2GRD_TXPOL          0x01
#define _AAD2GRD_GRD2POL        0x20
#define _AAD2GRD_GRDPOL         0x20
#define _AAD2GRD_GRD2AOE        0x40
#define _AAD2GRD_GRDAOE         0x40
#define _AAD2GRD_GRD2BOE        0x80
#define _AAD2GRD_GRDBOE         0x80

//==============================================================================


//==============================================================================
//        AD2GRD Bits

extern __at(0x0798) __sfr AD2GRD;

typedef union
  {
  struct
    {
    unsigned TX2POL             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned GRD2POL            : 1;
    unsigned GRD2AOE            : 1;
    unsigned GRD2BOE            : 1;
    };

  struct
    {
    unsigned TXPOL              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned GRDPOL             : 1;
    unsigned GRDAOE             : 1;
    unsigned GRDBOE             : 1;
    };
  } __AD2GRDbits_t;

extern __at(0x0798) volatile __AD2GRDbits_t AD2GRDbits;

#define _AD2GRD_TX2POL          0x01
#define _AD2GRD_TXPOL           0x01
#define _AD2GRD_GRD2POL         0x20
#define _AD2GRD_GRDPOL          0x20
#define _AD2GRD_GRD2AOE         0x40
#define _AD2GRD_GRDAOE          0x40
#define _AD2GRD_GRD2BOE         0x80
#define _AD2GRD_GRDBOE          0x80

//==============================================================================


//==============================================================================
//        AAD2CAP Bits

extern __at(0x0799) __sfr AAD2CAP;

typedef union
  {
  struct
    {
    unsigned ADDCAP0            : 1;
    unsigned ADDCAP1            : 1;
    unsigned ADDCAP2            : 1;
    unsigned ADDCAP3            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADDCAP             : 4;
    unsigned                    : 4;
    };
  } __AAD2CAPbits_t;

extern __at(0x0799) volatile __AAD2CAPbits_t AAD2CAPbits;

#define _AAD2CAP_ADDCAP0        0x01
#define _AAD2CAP_ADDCAP1        0x02
#define _AAD2CAP_ADDCAP2        0x04
#define _AAD2CAP_ADDCAP3        0x08

//==============================================================================


//==============================================================================
//        AAD2CAPCON Bits

extern __at(0x0799) __sfr AAD2CAPCON;

typedef union
  {
  struct
    {
    unsigned ADDCAP0            : 1;
    unsigned ADDCAP1            : 1;
    unsigned ADDCAP2            : 1;
    unsigned ADDCAP3            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADDCAP             : 4;
    unsigned                    : 4;
    };
  } __AAD2CAPCONbits_t;

extern __at(0x0799) volatile __AAD2CAPCONbits_t AAD2CAPCONbits;

#define _AAD2CAPCON_ADDCAP0     0x01
#define _AAD2CAPCON_ADDCAP1     0x02
#define _AAD2CAPCON_ADDCAP2     0x04
#define _AAD2CAPCON_ADDCAP3     0x08

//==============================================================================


//==============================================================================
//        AD2CAPCON Bits

extern __at(0x0799) __sfr AD2CAPCON;

typedef union
  {
  struct
    {
    unsigned ADDCAP0            : 1;
    unsigned ADDCAP1            : 1;
    unsigned ADDCAP2            : 1;
    unsigned ADDCAP3            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADDCAP             : 4;
    unsigned                    : 4;
    };
  } __AD2CAPCONbits_t;

extern __at(0x0799) volatile __AD2CAPCONbits_t AD2CAPCONbits;

#define _AD2CAPCON_ADDCAP0      0x01
#define _AD2CAPCON_ADDCAP1      0x02
#define _AD2CAPCON_ADDCAP2      0x04
#define _AD2CAPCON_ADDCAP3      0x08

//==============================================================================

extern __at(0x079A) __sfr AAD2RES0;
extern __at(0x079A) __sfr AAD2RES0L;
extern __at(0x079A) __sfr AD2RES0;
extern __at(0x079B) __sfr AAD2RES0H;
extern __at(0x079C) __sfr AAD2RES1;
extern __at(0x079C) __sfr AAD2RES1L;
extern __at(0x079C) __sfr AD2RES1;
extern __at(0x079D) __sfr AAD2RES1H;
extern __at(0x079E) __sfr AAD2CH;

//==============================================================================
//        AAD2CH0 Bits

extern __at(0x079E) __sfr AAD2CH0;

typedef struct
  {
  unsigned CH20                 : 1;
  unsigned CH21                 : 1;
  unsigned CH22                 : 1;
  unsigned CH23                 : 1;
  unsigned CH24                 : 1;
  unsigned CH25                 : 1;
  unsigned CH26                 : 1;
  unsigned CH27                 : 1;
  } __AAD2CH0bits_t;

extern __at(0x079E) volatile __AAD2CH0bits_t AAD2CH0bits;

#define _CH20                   0x01
#define _CH21                   0x02
#define _CH22                   0x04
#define _CH23                   0x08
#define _CH24                   0x10
#define _CH25                   0x20
#define _CH26                   0x40
#define _CH27                   0x80

//==============================================================================

extern __at(0x079E) __sfr AD2CH;

//==============================================================================
//        AD2CH0 Bits

extern __at(0x079E) __sfr AD2CH0;

typedef struct
  {
  unsigned CH20                 : 1;
  unsigned CH21                 : 1;
  unsigned CH22                 : 1;
  unsigned CH23                 : 1;
  unsigned CH24                 : 1;
  unsigned CH25                 : 1;
  unsigned CH26                 : 1;
  unsigned CH27                 : 1;
  } __AD2CH0bits_t;

extern __at(0x079E) volatile __AD2CH0bits_t AD2CH0bits;

#define _AD2CH0_CH20            0x01
#define _AD2CH0_CH21            0x02
#define _AD2CH0_CH22            0x04
#define _AD2CH0_CH23            0x08
#define _AD2CH0_CH24            0x10
#define _AD2CH0_CH25            0x20
#define _AD2CH0_CH26            0x40
#define _AD2CH0_CH27            0x80

//==============================================================================


//==============================================================================
//        AAD2CH1 Bits

extern __at(0x079F) __sfr AAD2CH1;

typedef struct
  {
  unsigned CH28                 : 1;
  unsigned CH29                 : 1;
  unsigned CH40                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __AAD2CH1bits_t;

extern __at(0x079F) volatile __AAD2CH1bits_t AAD2CH1bits;

#define _CH28                   0x01
#define _CH29                   0x02
#define _CH40                   0x04

//==============================================================================


//==============================================================================
//        AD2CH1 Bits

