OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1566.h
#define CH18                    AAD1CH1bits.CH18                // bit 0
#define CH19                    AAD1CH1bits.CH19                // bit 1

#define ADON                    AAD1CON0bits.ADON               // bit 0, shadows bit in AAD1CON0bits
#define AD1ON                   AAD1CON0bits.AD1ON              // bit 0, shadows bit in AAD1CON0bits
#define GO                      AAD1CON0bits.GO                 // bit 1, shadows bit in AAD1CON0bits
#define GO_NOT_DONE             AAD1CON0bits.GO_NOT_DONE        // bit 1, shadows bit in AAD1CON0bits
#define GO_NOT_DONE1            AAD1CON0bits.GO_NOT_DONE1       // bit 1, shadows bit in AAD1CON0bits
#define CHS0                    AAD1CON0bits.CHS0               // bit 2
#define CHS1                    AAD1CON0bits.CHS1               // bit 3
#define CHS2                    AAD1CON0bits.CHS2               // bit 4
#define CHS3                    AAD1CON0bits.CHS3               // bit 5
#define CHS4                    AAD1CON0bits.CHS4               // bit 6
#define CHS5                    AAD1CON0bits.CHS5               // bit 7

#define TRIGSEL0                AAD1CON2bits.TRIGSEL0           // bit 4
#define TRIGSEL1                AAD1CON2bits.TRIGSEL1           // bit 5
#define TRIGSEL2                AAD1CON2bits.TRIGSEL2           // bit 6

#define AD1DSEN                 AAD1CON3bits.AD1DSEN            // bit 0, shadows bit in AAD1CON3bits
#define ADDSEN                  AAD1CON3bits.ADDSEN             // bit 0, shadows bit in AAD1CON3bits
#define AD1IPEN                 AAD1CON3bits.AD1IPEN            // bit 1, shadows bit in AAD1CON3bits
#define ADIPEN                  AAD1CON3bits.ADIPEN             // bit 1, shadows bit in AAD1CON3bits
#define AD1IPPOL                AAD1CON3bits.AD1IPPOL           // bit 6, shadows bit in AAD1CON3bits
#define ADIPPOL                 AAD1CON3bits.ADIPPOL            // bit 6, shadows bit in AAD1CON3bits
#define AD1EPPOL                AAD1CON3bits.AD1EPPOL           // bit 7, shadows bit in AAD1CON3bits
#define ADEPPOL                 AAD1CON3bits.ADEPPOL            // bit 7, shadows bit in AAD1CON3bits

#define TX1POL                  AAD1GRDbits.TX1POL              // bit 0, shadows bit in AAD1GRDbits
#define TXPOL                   AAD1GRDbits.TXPOL               // bit 0, shadows bit in AAD1GRDbits
#define GRD1POL                 AAD1GRDbits.GRD1POL             // bit 5, shadows bit in AAD1GRDbits
#define GRDPOL                  AAD1GRDbits.GRDPOL              // bit 5, shadows bit in AAD1GRDbits
#define GRD1AOE                 AAD1GRDbits.GRD1AOE             // bit 6, shadows bit in AAD1GRDbits
#define GRDAOE                  AAD1GRDbits.GRDAOE              // bit 6, shadows bit in AAD1GRDbits
#define GRD1BOE                 AAD1GRDbits.GRD1BOE             // bit 7, shadows bit in AAD1GRDbits
#define GRDBOE                  AAD1GRDbits.GRDBOE              // bit 7, shadows bit in AAD1GRDbits

#define ADPRE0                  AAD1PREbits.ADPRE0              // bit 0
#define ADPRE1                  AAD1PREbits.ADPRE1              // bit 1
#define ADPRE2                  AAD1PREbits.ADPRE2              // bit 2
#define ADPRE3                  AAD1PREbits.ADPRE3              // bit 3
#define ADPRE4                  AAD1PREbits.ADPRE4              // bit 4
#define ADPRE5                  AAD1PREbits.ADPRE5              // bit 5
#define ADPRE6                  AAD1PREbits.ADPRE6              // bit 6

#define TX10                    AAD1TX0bits.TX10                // bit 0
#define TX11                    AAD1TX0bits.TX11                // bit 1
#define TX12                    AAD1TX0bits.TX12                // bit 2
#define TX13                    AAD1TX0bits.TX13                // bit 3
#define TX14                    AAD1TX0bits.TX14                // bit 4
#define TX15                    AAD1TX0bits.TX15                // bit 5
#define TX16                    AAD1TX0bits.TX16                // bit 6
#define TX17                    AAD1TX0bits.TX17                // bit 7

#define TX18                    AAD1TX1bits.TX18                // bit 0
#define TX19                    AAD1TX1bits.TX19                // bit 1

#define CH20                    AAD2CH0bits.CH20                // bit 0
#define CH21                    AAD2CH0bits.CH21                // bit 1
#define CH22                    AAD2CH0bits.CH22                // bit 2
#define CH23                    AAD2CH0bits.CH23                // bit 3
#define CH24                    AAD2CH0bits.CH24                // bit 4
#define CH25                    AAD2CH0bits.CH25                // bit 5
#define CH26                    AAD2CH0bits.CH26                // bit 6
#define CH27                    AAD2CH0bits.CH27                // bit 7

#define CH28                    AAD2CH1bits.CH28                // bit 0
#define CH29                    AAD2CH1bits.CH29                // bit 1
#define CH40                    AAD2CH1bits.CH40                // bit 2

#define TX20                    AAD2TX0bits.TX20                // bit 0
#define TX21                    AAD2TX0bits.TX21                // bit 1
#define TX22                    AAD2TX0bits.TX22                // bit 2
#define TX23                    AAD2TX0bits.TX23                // bit 3
#define TX24                    AAD2TX0bits.TX24                // bit 4
#define TX25                    AAD2TX0bits.TX25                // bit 5
#define TX26                    AAD2TX0bits.TX26                // bit 6
#define TX27                    AAD2TX0bits.TX27                // bit 7

#define TX28                    AAD2TX1bits.TX28                // bit 0
#define TX29                    AAD2TX1bits.TX29                // bit 1
#define TX40                    AAD2TX1bits.TX40                // bit 2

#define ADPREF0                 AADCON1bits.ADPREF0             // bit 0
#define ADPREF1                 AADCON1bits.ADPREF1             // bit 1
#define GO_NOT_DONE_ALL         AADCON1bits.GO_NOT_DONE_ALL     // bit 2, shadows bit in AADCON1bits
#define GO_ALL                  AADCON1bits.GO_ALL              // bit 2, shadows bit in AADCON1bits
#define ADNREF                  AADCON1bits.ADNREF              // bit 3
#define ADCS0                   AADCON1bits.ADCS0               // bit 4
#define ADCS1                   AADCON1bits.ADCS1               // bit 5
#define ADCS2                   AADCON1bits.ADCS2               // bit 6
#define ADFM                    AADCON1bits.ADFM                // bit 7

#define AD1STG0                 AADSTATbits.AD1STG0             // bit 0
#define AD1STG1                 AADSTATbits.AD1STG1             // bit 1
#define AD1CONV                 AADSTATbits.AD1CONV             // bit 2, shadows bit in AADSTATbits
#define ADCONV                  AADSTATbits.ADCONV              // bit 2, shadows bit in AADSTATbits
#define AD2STG0                 AADSTATbits.AD2STG0             // bit 4
#define AD2STG1                 AADSTATbits.AD2STG1             // bit 5
#define AD2CONV                 AADSTATbits.AD2CONV             // bit 6

